jjjjqx960-wq/esp32-remote-power/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_LOG_COLORS=n
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ---- fill these in before flashing (or use idf.py menuconfig) ----
CONFIG_RELAY_WIFI_SSID="YourSSID"
CONFIG_RELAY_WIFI_PASSWORD="YourPassword"
CONFIG_RELAY_WIFI_COUNTRY="CN"
# TX power in 0.25 dBm units. 60 = 15 dBm. Super Mini boards often need this;
# at the IDF default (~20 dBm) the AP may silently ignore auth frames.
CONFIG_RELAY_WIFI_TX_POWER=60
CONFIG_RELAY_BASE_URL="https://relay.example.com/relay"
CONFIG_RELAY_TOKEN="change-me-long-random-token"
CONFIG_RELAY_WOL_DEFAULT_MAC="aa:bb:cc:dd:ee:ff"
